{"ingredients": ["1 teaspoon garlic paste", "1/2 teaspoon lemon juice", "1/2 teaspoon ground turmeric", "salt to taste", "3 (6 ounce) fillets butterfish", "1 ripe coconut", "1 1/8 cups water", "1 tablespoon vegetable oil", "2 pods cardamom, coarsely ground", "1 (1 inch) piece cinnamon stick", "2 bay leaves", "2 large onions, chopped", "1 (1 inch) piece fresh ginger, peeled and julienned", "4 green chile peppers, halved", "1 teaspoon ground coriander", "1/4 teaspoon ground white pepper", "2 tomatoes, quartered"], "recipe": ["Mix garlic paste, lemon juice, turmeric, and salt in a small bowl until a paste forms. Coat both sides of the butterfish with the mixture and transfer to a plate. Cover and marinate in the refrigerator for 1 hour.", "While the fish is marinating, puncture holes in the coconut's eyes with a sharp knife or skewer. Turn coconut upside down over a glass and allow water to drain completely.", "Break coconut open; pry the meat from the shell with a knife and remove any dark skin with a vegetable peeler.", "Cut the coconut into small chunks and place in a blender. Add 2 tablespoons water and blend on high until smooth. Pour into a muslin cloth over a medium bowl. Squeeze gently to remove as much liquid as possible.", "Return the coconut pulp to the blender; add 1 cup water. Process until smooth. Pour the mixture into the muslin cloth over a second bowl, squeezing to remove as much liquid as possible. Discard the pulp.", "Heat oil in a wok over medium-high heat. Add cardamom, cinnamon stick, and bay leaves; cook until fragrant, about 30 seconds. Add onions and saute until slightly softened, 4 to 5 minutes. Add ginger and chile peppers; cook for 1 minute.", "Add coriander and white pepper; mix thoroughly. Pour in second batch of coconut milk. Add fish; bring to a boil. Lower heat slightly and simmer until fish flakes easily with a fork and cooking liquid has reduced, 4 to 5 minutes. Stir in the first batch of coconut milk and immediately remove from the heat.", "Allow to cool for several minutes, stirring occasionally. Remove the bay leaves and cinnamon stick and serve hot, garnished with tomatoes."]}