{"ingredients": ["For the Ginger-Garlic Paste:", "5 cloves garlic, chopped", "1 (2 inch) piece fresh ginger root, chopped", "For the Kebabs:", "1/2 cup plain yogurt", "2 tablespoons mustard oil", "1/2 lime, juiced", "1 1/2 teaspoons dried fenugreek leaves", "1 teaspoon garam masala", "1/2 teaspoon cayenne pepper, or to taste", "16 ounces paneer, cut into 1-inch cubes", "1 green bell pepper, cut in 1-inch pieces", "1 red bell pepper, cut in 1-inch pieces", "1/2 large onion, cut into 1-inch pieces", "For the Sauce:", "1/2 cup cashews", "2 tablespoons olive oil", "2 teaspoons cumin seeds", "1/2 onion, finely chopped", "1 tablespoon dried fenugreek leaves", "1/2 teaspoon garam masala", "2 large tomatoes, finely chopped", "1/2 lime, juiced", "1 tablespoon ground coriander", "1 teaspoon cayenne pepper, or to taste", "1/2 teaspoon ground turmeric", "salt to taste"], "recipe": ["Soak 8 to 10 wooden skewers in water while you prepare the kebabs.", "Process garlic and ginger in a food processor until a smooth paste forms.", "Combine yogurt, mustard oil, lime juice of 1/2 lime, 1 1/2 teaspoons fenugreek leaves, 1 teaspoon garam masala, 1/2 teaspoon cayenne, and 1/2 of the ginger-garlic paste in a bowl. Whisk until smooth. Add paneer, green bell pepper, red bell pepper, and onion. Stir until coated.", "Preheat the oven to 400 degrees F (200 degrees C).", "Thread the coated paneer, peppers, and onion onto the soaked skewers. Place kebabs in a baking dish.", "Bake in the preheated oven until kebabs are golden brown, 25 to 30 minutes.", "Soak cashews in a bowl of hot water for 10 minutes; blend as finely or coarsely as desired.", "Heat olive oil in a large saucepan over medium-high heat. Add cumin seeds; cook until sputtering, about 1 minute. Add remaining onion; cook and stir until translucent, about 5 minutes. Add the remaining ginger-garlic paste, 1 tablespoon fenugreek leaves, and 1/2 teaspoon garam masala. Cook and stir until flavors blend, about 2 minutes. Stir in tomatoes; cover and cook until tomatoes break down, about 5 minutes.", "Stir the ground cashews into the saucepan with the tomato mixture. Add juice of 1/2 lime, coriander, 1 teaspoon cayenne, turmeric, and salt. Let simmer until sauce is thickened, adding some water if sauce gets too dry and sticks to the pan, about 5 minutes more. Add the baked kebabs to the sauce. Stir to coat evenly."]}